hananddong/ble_uwb_code/UWB_BLE_nrf52832/integration/nrfx/legacy/nrf_drv_twi.h
/**
    Copyright (c) 2015 - 2018, Nordic Semiconductor ASA

    All rights reserved.

    Redistribution and use in source and binary forms, with or without modification,
    are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
      list of conditions and the following disclaimer.

    2. Redistributions in binary form, except as embedded into a Nordic
      Semiconductor ASA integrated circuit in a product or a software update for
      such product, must reproduce the above copyright notice, this list of
      conditions and the following disclaimer in the documentation and/or other
      materials provided with the distribution.

    3. Neither the name of Nordic Semiconductor ASA nor the names of its
      contributors may be used to endorse or promote products derived from this
      software without specific prior written permission.

    4. This software, with or without modification, must only be used with a
      Nordic Semiconductor ASA integrated circuit.

    5. Any software provided in binary form under this license must not be reverse
      engineered, decompiled, modified and/or disassembled.

    THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
    OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
    OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
    DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
    LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
    CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
    GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
    HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
    LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
    OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

*/

#ifndef NRF_DRV_TWI_H__
#define NRF_DRV_TWI_H__

#include <nrfx.h>
#ifdef TWIM_PRESENT
    #include <nrfx_twim.h>
#else
    // Compilers (at least the smart ones) will remove the TWIM related code
    // (blocks starting with "if (NRF_DRV_TWI_USE_TWIM)") when it is not used,
    // but to perform the compilation they need the following definitions.
    #define nrfx_twim_init(...)                 0
    #define nrfx_twim_uninit(...)
    #define nrfx_twim_enable(...)
    #define nrfx_twim_disable(...)
    #define nrfx_twim_tx(...)                   0
    #define nrfx_twim_rx(...)                   0
    #define nrfx_twim_is_busy(...)              0
    #define nrfx_twim_start_task_get(...)       0
    #define nrfx_twim_stopped_event_get(...)    0
#endif

#ifdef TWI_PRESENT
    #include <nrfx_twi.h>
#else
    // Compilers (at least the smart ones) will remove the TWI related code
    // (blocks starting with "if (NRF_DRV_TWI_USE_TWI)") when it is not used,
    // but to perform the compilation they need the following definitions.
    #define nrfx_twi_init(...)                  0
    #define nrfx_twi_uninit(...)
    #define nrfx_twi_enable(...)
    #define nrfx_twi_disable(...)
    #define nrfx_twi_tx(...)                    0
    #define nrfx_twi_rx(...)                    0
    #define nrfx_twi_is_busy(...)               0
    #define nrfx_twi_data_count_get(...)        0
    #define nrfx_twi_stopped_event_get(...)     0
    
    // This part is for old modules that use directly TWI HAL definitions
    // (to make them compilable for chips that have only TWIM).
    #define NRF_TWI_ERROR_ADDRESS_NACK  NRF_TWIM_ERROR_ADDRESS_NACK
    #define NRF_TWI_ERROR_DATA_NACK     NRF_TWIM_ERROR_DATA_NACK
    #define NRF_TWI_FREQ_100K           NRF_TWIM_FREQ_100K
    #define NRF_TWI_FREQ_250K           NRF_TWIM_FREQ_250K
    #define NRF_TWI_FREQ_400K           NRF_TWIM_FREQ_400K
#endif

#ifdef __cplusplus
extern "C" {
#endif

/**
    @defgroup nrf_drv_twi TWI driver - legacy layer
    @{
    @ingroup  nrf_twi
    @brief    Layer providing compatibility with the former API.
*/

/**
    @brief Structure for the TWI master driver instance.
*/
typedef struct
{
    uint8_t inst_idx;
    union
    {
        #ifdef TWIM_PRESENT
        nrfx_twim_t twim;
        #endif
        #ifdef TWI_PRESENT
        nrfx_twi_t  twi;
        #endif
    } u;
    bool    use_easy_dma;
} nrf_drv_twi_t;

/**
    @brief Macro for creating a TWI master driver instance.
*/
#define NRF_DRV_TWI_INSTANCE(id)    NRF_DRV_TWI_INSTANCE_(id)
#define NRF_DRV_TWI_INSTANCE_(id)   NRF_DRV_TWI_INSTANCE_ ## id
#if NRFX_CHECK(NRFX_TWIM0_ENABLED)
#define NRF_DRV_TWI_INSTANCE_0 \
    { 0, { .twim = NRFX_TWIM_INSTANCE(0) }, true }
#elif NRFX_CHECK(NRFX_TWI0_ENABLED)
#define NRF_DRV_TWI_INSTANCE_0 \
    { 0, { .twi = NRFX_TWI_INSTANCE(0) }, false }
#endif
#if NRFX_CHECK(NRFX_TWIM1_ENABLED)
#define NRF_DRV_TWI_INSTANCE_1 \
    { 1, { .twim = NRFX_TWIM_INSTANCE(1) }, true }
#elif NRFX_CHECK(NRFX_TWI1_ENABLED)
#define NRF_DRV_TWI_INSTANCE_1 \
    { 1, { .twi = NRFX_TWI_INSTANCE(1) }, false }
#endif

/**
    @brief TWI master clock frequency.
*/
typedef enum
{
    NRF_DRV_TWI_FREQ_100K = NRF_TWI_FREQ_100K,  ///< 100 kbps.
    NRF_DRV_TWI_FREQ_250K = NRF_TWI_FREQ_250K,  ///< 250 kbps.
    NRF_DRV_TWI_FREQ_400K = NRF_TWI_FREQ_400K   ///< 400 kbps.
} nrf_drv_twi_frequency_t;

/**
    @brief Structure for the TWI master driver instance configuration.
*/
typedef struct
{
    uint32_t                scl;                 ///< SCL pin number.
    uint32_t                sda;                 ///< SDA pin number.
    nrf_drv_twi_frequency_t frequency;           ///< TWI frequency.
    uint8_t                 interrupt_priority;  ///< Interrupt priority.
    bool                    clear_bus_init;      ///< Clear bus during init.
    bool                    hold_bus_uninit;     ///< Hold pull up state on gpio pins after uninit.
} nrf_drv_twi_config_t;

/**
    @brief TWI master driver instance default configuration.
*/
#define NRF_DRV_TWI_DEFAULT_CONFIG                                               \
    {                                                                                \
        .frequency          = (nrf_drv_twi_frequency_t)TWI_DEFAULT_CONFIG_FREQUENCY, \
                              .scl                = 31,                                                    \
                                                    .sda                = 31,                                                    \
                                                                          .interrupt_priority = TWI_DEFAULT_CONFIG_IRQ_PRIORITY,                       \
                                                                                                .clear_bus_init     = TWI_DEFAULT_CONFIG_CLR_BUS_INIT,                       \
                                                                                                        .hold_bus_uninit    = TWI_DEFAULT_CONFIG_HOLD_BUS_UNINIT,                    \
    }

