hananddong/ble_uwb_code/UWB_BLE_nrf52832/integration/nrfx/legacy/nrf_drv_twi.h
#define NRF_DRV_TWI_FLAG_TX_POSTINC          (1UL << 0) /**< TX buffer address incremented after transfer. */
#define NRF_DRV_TWI_FLAG_RX_POSTINC          (1UL << 1) /**< RX buffer address incremented after transfer. */
#define NRF_DRV_TWI_FLAG_NO_XFER_EVT_HANDLER (1UL << 2) /**< Interrupt after each transfer is suppressed, and the event handler is not called. */
#define NRF_DRV_TWI_FLAG_HOLD_XFER           (1UL << 3) /**< Set up the transfer but do not start it. */
#define NRF_DRV_TWI_FLAG_REPEATED_XFER       (1UL << 4) /**< Flag indicating that the transfer will be executed multiple times. */
#define NRF_DRV_TWI_FLAG_TX_NO_STOP          (1UL << 5) /**< Flag indicating that the TX transfer will not end with a stop condition. */

/**
    @brief TWI master driver event types.
*/
typedef enum
{
    NRF_DRV_TWI_EVT_DONE,         ///< Transfer completed event.
    NRF_DRV_TWI_EVT_ADDRESS_NACK, ///< Error event: NACK received after sending the address.
    NRF_DRV_TWI_EVT_DATA_NACK     ///< Error event: NACK received after sending a data byte.
} nrf_drv_twi_evt_type_t;

/**
    @brief TWI master driver transfer types.
*/
typedef enum
{
    NRF_DRV_TWI_XFER_TX,          ///< TX transfer.
    NRF_DRV_TWI_XFER_RX,          ///< RX transfer.
    NRF_DRV_TWI_XFER_TXRX,        ///< TX transfer followed by RX transfer with repeated start.
    NRF_DRV_TWI_XFER_TXTX         ///< TX transfer followed by TX transfer with repeated start.
} nrf_drv_twi_xfer_type_t;

/**
    @brief Structure for a TWI transfer descriptor.
*/
typedef struct
{
    nrf_drv_twi_xfer_type_t type;             ///< Type of transfer.
    uint8_t                 address;          ///< Slave address.
    uint8_t                 primary_length;   ///< Number of bytes transferred.
    uint8_t                 secondary_length; ///< Number of bytes transferred.
    uint8_t                *p_primary_buf;    ///< Pointer to transferred data.
    uint8_t                *p_secondary_buf;  ///< Pointer to transferred data.
} nrf_drv_twi_xfer_desc_t;


/**@brief Macro for setting the TX transfer descriptor. */
#define NRF_DRV_TWI_XFER_DESC_TX(addr, p_data, length)                 \
    {                                                                  \
        .type = NRF_DRV_TWI_XFER_TX,                                   \
                .address = addr,                                               \
                           .primary_length = length,                                      \
                                             .p_primary_buf  = p_data,                                      \
    }

/**@brief Macro for setting the RX transfer descriptor. */
#define NRF_DRV_TWI_XFER_DESC_RX(addr, p_data, length)                 \
    {                                                                  \
        .type = NRF_DRV_TWI_XFER_RX,                                   \
                .address = addr,                                               \
                           .primary_length = length,                                      \
                                             .p_primary_buf  = p_data,                                      \
    }

/**@brief Macro for setting the TXRX transfer descriptor. */
#define NRF_DRV_TWI_XFER_DESC_TXRX(addr, p_tx, tx_len, p_rx, rx_len)   \
    {                                                                  \
        .type = NRF_DRV_TWI_XFER_TXRX,                                 \
                .address = addr,                                               \
                           .primary_length   = tx_len,                                    \
                                               .secondary_length = rx_len,                                    \
                                                                   .p_primary_buf    = p_tx,                                      \
                                                                                       .p_secondary_buf  = p_rx,                                      \
    }

/**@brief Macro for setting the TXTX transfer descriptor. */
#define NRF_DRV_TWI_XFER_DESC_TXTX(addr, p_tx, tx_len, p_tx2, tx_len2) \
    {                                                                  \
        .type = NRF_DRV_TWI_XFER_TXTX,                                 \
                .address = addr,                                               \
                           .primary_length   = tx_len,                                    \
                                               .secondary_length = tx_len2,                                   \
                                                                   .p_primary_buf    = p_tx,                                      \
                                                                                       .p_secondary_buf  = p_tx2,                                     \
    }

/**
    @brief Structure for a TWI event.
*/
typedef struct
{
    nrf_drv_twi_evt_type_t  type;      ///< Event type.
    nrf_drv_twi_xfer_desc_t xfer_desc; ///< Transfer details.
} nrf_drv_twi_evt_t;

/**
    @brief TWI event handler prototype.
*/
typedef void (* nrf_drv_twi_evt_handler_t)(nrf_drv_twi_evt_t const *p_event,
                                           void                     *p_context);
                                           
/**
    @brief Function for initializing the TWI driver instance.

    @param[in] p_instance      Pointer to the driver instance structure.
    @param[in] p_config        Initial configuration.
    @param[in] event_handler   Event handler provided by the user. If NULL, blocking mode is enabled.
    @param[in] p_context       Context passed to event handler.

    @retval NRF_SUCCESS             If initialization was successful.
    @retval NRF_ERROR_INVALID_STATE If the driver is in invalid state.
    @retval NRF_ERROR_BUSY          If some other peripheral with the same
                                   instance ID is already in use. This is
                                   possible only if PERIPHERAL_RESOURCE_SHARING_ENABLED
                                   is set to a value other than zero.
*/
ret_code_t nrf_drv_twi_init(nrf_drv_twi_t const         *p_instance,
                            nrf_drv_twi_config_t const *p_config,
                            nrf_drv_twi_evt_handler_t    event_handler,
                            void                        *p_context);
                            
/**
    @brief Function for uninitializing the TWI instance.

    @param[in] p_instance Pointer to the driver instance structure.
*/
__STATIC_INLINE
void nrf_drv_twi_uninit(nrf_drv_twi_t const *p_instance);

/**
    @brief Function for enabling the TWI instance.

    @param[in] p_instance Pointer to the driver instance structure.
*/
__STATIC_INLINE
void nrf_drv_twi_enable(nrf_drv_twi_t const *p_instance);

/**
    @brief Function for disabling the TWI instance.

    @param[in] p_instance Pointer to the driver instance structure.
*/
__STATIC_INLINE
void nrf_drv_twi_disable(nrf_drv_twi_t const *p_instance);

/**
    @brief Function for sending data to a TWI slave.

    The transmission will be stopped when an error occurs. If a transfer is ongoing,
    the function returns the error code @ref NRF_ERROR_BUSY.

    @param[in] p_instance Pointer to the driver instance structure.
    @param[in] address    Address of a specific slave device (only 7 LSB).
    @param[in] p_data     Pointer to a transmit buffer.
    @param[in] length     Number of bytes to send.
    @param[in] no_stop    If set, the stop condition is not generated on the bus
                         after the transfer has completed successfully (allowing
                         for a repeated start in the next transfer).

    @retval NRF_SUCCESS                  If the procedure was successful.
    @retval NRF_ERROR_BUSY               If the driver is not ready for a new transfer.
    @retval NRF_ERROR_INTERNAL           If an error was detected by hardware.
    @retval NRF_ERROR_INVALID_ADDR       If the EasyDMA is used and memory adress in not in RAM.
    @retval NRF_ERROR_DRV_TWI_ERR_ANACK  If NACK received after sending the address in polling mode.
    @retval NRF_ERROR_DRV_TWI_ERR_DNACK  If NACK received after sending a data byte in polling mode.
*/
__STATIC_INLINE
ret_code_t nrf_drv_twi_tx(nrf_drv_twi_t const *p_instance,
                          uint8_t               address,
                          uint8_t const        *p_data,
                          uint8_t               length,
                          bool                  no_stop);
                          
/**
    @brief Function for reading data from a TWI slave.

    The transmission will be stopped when an error occurs. If a transfer is ongoing,
    the function returns the error code @ref NRF_ERROR_BUSY.

    @param[in] p_instance Pointer to the driver instance structure.
    @param[in] address    Address of a specific slave device (only 7 LSB).
    @param[in] p_data     Pointer to a receive buffer.
    @param[in] length     Number of bytes to be received.

    @retval NRF_SUCCESS                    If the procedure was successful.
    @retval NRF_ERROR_BUSY                 If the driver is not ready for a new transfer.
    @retval NRF_ERROR_INTERNAL             If an error was detected by hardware.
    @retval NRF_ERROR_DRV_TWI_ERR_OVERRUN  If the unread data was replaced by new data
    @retval NRF_ERROR_DRV_TWI_ERR_ANACK    If NACK received after sending the address in polling mode.
    @retval NRF_ERROR_DRV_TWI_ERR_DNACK    If NACK received after sending a data byte in polling mode.
*/
__STATIC_INLINE
ret_code_t nrf_drv_twi_rx(nrf_drv_twi_t const *p_instance,
                          uint8_t               address,
                          uint8_t              *p_data,
                          uint8_t               length);
                          
/**
    @brief Function for preparing a TWI transfer.

