hananddong/ble_uwb_code/UWB_BLE_nrf52832/integration/nrfx/legacy/nrf_drv_twi.h
    The following transfer types can be configured (@ref nrf_drv_twi_xfer_desc_t::type):
    - @ref NRF_DRV_TWI_XFER_TXRX<span></span>: Write operation followed by a read operation (without STOP condition in between).
    - @ref NRF_DRV_TWI_XFER_TXTX<span></span>: Write operation followed by a write operation (without STOP condition in between).
    - @ref NRF_DRV_TWI_XFER_TX<span></span>:   Write operation (with or without STOP condition).
    - @ref NRF_DRV_TWI_XFER_RX<span></span>:   Read operation  (with STOP condition).

    Additional options are provided using the flags parameter:
    - @ref NRF_DRV_TWI_FLAG_TX_POSTINC and @ref NRF_DRV_TWI_FLAG_RX_POSTINC<span></span>: Post-incrementation of buffer addresses. Supported only by TWIM.
    - @ref NRF_DRV_TWI_FLAG_NO_XFER_EVT_HANDLER<span></span>: No user event handler after transfer completion. In most cases, this also means no interrupt at the end of the transfer.
    - @ref NRF_DRV_TWI_FLAG_HOLD_XFER<span></span>: Driver is not starting the transfer. Use this flag if the transfer is triggered externally by PPI. Supported only by TWIM.
     Use @ref nrf_drv_twi_start_task_get to get the address of the start task.
    - @ref NRF_DRV_TWI_FLAG_REPEATED_XFER<span></span>: Prepare for repeated transfers. You can set up a number of transfers that will be triggered externally (for example by PPI).
     An example is a TXRX transfer with the options @ref NRF_DRV_TWI_FLAG_RX_POSTINC, @ref NRF_DRV_TWI_FLAG_NO_XFER_EVT_HANDLER, and @ref NRF_DRV_TWI_FLAG_REPEATED_XFER.
     After the transfer is set up, a set of transfers can be triggered by PPI that will read, for example, the same register of an
     external component and put it into a RAM buffer without any interrupts. @ref nrf_drv_twi_stopped_event_get can be used to get the
     address of the STOPPED event, which can be used to count the number of transfers. If @ref NRF_DRV_TWI_FLAG_REPEATED_XFER is used,
     the driver does not set the driver instance into busy state, so you must ensure that the next transfers are set up
     when TWIM is not active. Supported only by TWIM.
    - @ref NRF_DRV_TWI_FLAG_TX_NO_STOP<span></span>: No stop condition after TX transfer.

    @note
    Some flag combinations are invalid:
    - @ref NRF_DRV_TWI_FLAG_TX_NO_STOP with @ref nrf_drv_twi_xfer_desc_t::type different than @ref NRF_DRV_TWI_XFER_TX
    - @ref NRF_DRV_TWI_FLAG_REPEATED_XFER with @ref nrf_drv_twi_xfer_desc_t::type set to @ref NRF_DRV_TWI_XFER_TXTX

    If @ref nrf_drv_twi_xfer_desc_t::type is set to @ref NRF_DRV_TWI_XFER_TX and the @ref NRF_DRV_TWI_FLAG_TX_NO_STOP and @ref NRF_DRV_TWI_FLAG_REPEATED_XFER
    flags are set, two tasks must be used to trigger a transfer: TASKS_RESUME followed by TASKS_STARTTX. If no stop condition is generated,
    TWIM is in SUSPENDED state. Therefore, it must be resumed before the transfer can be started.

    @note
    This function should be used only if the instance is configured to work in non-blocking mode. If the function is used in blocking mode, the driver asserts.
    @note If you are using this function with TWI, the only supported flag is @ref NRF_DRV_TWI_FLAG_TX_NO_STOP. All other flags require TWIM.

    @param[in] p_instance        Pointer to the driver instance structure.
    @param[in] p_xfer_desc       Pointer to the transfer descriptor.
    @param[in] flags             Transfer options (0 for default settings).

    @retval NRF_SUCCESS                    If the procedure was successful.
    @retval NRF_ERROR_BUSY                 If the driver is not ready for a new transfer.
    @retval NRF_ERROR_NOT_SUPPORTED        If the provided parameters are not supported.
    @retval NRF_ERROR_INTERNAL             If an error was detected by hardware.
    @retval NRF_ERROR_INVALID_ADDR         If the EasyDMA is used and memory adress in not in RAM
    @retval NRF_ERROR_DRV_TWI_ERR_OVERRUN  If the unread data was replaced by new data (TXRX and RX)
    @retval NRF_ERROR_DRV_TWI_ERR_ANACK    If NACK received after sending the address.
    @retval NRF_ERROR_DRV_TWI_ERR_DNACK    If NACK received after sending a data byte.
*/
__STATIC_INLINE
ret_code_t nrf_drv_twi_xfer(nrf_drv_twi_t           const *p_instance,
                            nrf_drv_twi_xfer_desc_t const *p_xfer_desc,
                            uint32_t                        flags);
                            
/**
    @brief Function for checking the TWI driver state.

    @param[in] p_instance TWI instance.

    @retval true  If the TWI driver is currently busy performing a transfer.
    @retval false If the TWI driver is ready for a new transfer.
*/
__STATIC_INLINE
bool nrf_drv_twi_is_busy(nrf_drv_twi_t const *p_instance);

/**
    @brief Function for getting the transferred data count.

    This function provides valid results only in legacy mode.

    @param[in] p_instance Pointer to the driver instance structure.

    @return     Data count.
*/
__STATIC_INLINE
uint32_t nrf_drv_twi_data_count_get(nrf_drv_twi_t const *const p_instance);

/**
    @brief Function for returning the address of a TWI/TWIM start task.

    This function should be used if @ref nrf_drv_twi_xfer was called with the flag @ref NRF_DRV_TWI_FLAG_HOLD_XFER.
    In that case, the transfer is not started by the driver, but it must be started externally by PPI.

    @param[in]  p_instance Pointer to the driver instance structure.
    @param[in]  xfer_type  Transfer type used in the last call of the @ref nrf_drv_twi_xfer function.

    @return     Start task address (TX or RX) depending on the value of xfer_type.
*/
__STATIC_INLINE
uint32_t nrf_drv_twi_start_task_get(nrf_drv_twi_t const *p_instance, nrf_drv_twi_xfer_type_t xfer_type);

/**
    @brief Function for returning the address of a STOPPED TWI/TWIM event.

    A STOPPED event can be used to detect the end of a transfer if the @ref NRF_DRV_TWI_FLAG_NO_XFER_EVT_HANDLER
    option is used.

    @param[in]  p_instance Pointer to the driver instance structure.

    @return     STOPPED event address.
*/
__STATIC_INLINE
uint32_t nrf_drv_twi_stopped_event_get(nrf_drv_twi_t const *p_instance);


#ifndef SUPPRESS_INLINE_IMPLEMENTATION

#if defined(TWI_PRESENT) && !defined(TWIM_PRESENT)
#define NRF_DRV_TWI_WITH_TWI
#elif !defined(TWI_PRESENT) && defined(TWIM_PRESENT)
#define NRF_DRV_TWI_WITH_TWIM
#else
#if (NRFX_CHECK(TWI0_ENABLED) &&  NRFX_CHECK(TWI0_USE_EASY_DMA)) || \
(NRFX_CHECK(TWI1_ENABLED) &&  NRFX_CHECK(TWI1_USE_EASY_DMA))
#define NRF_DRV_TWI_WITH_TWIM
#endif
#if (NRFX_CHECK(TWI0_ENABLED) && !NRFX_CHECK(TWI0_USE_EASY_DMA)) || \
(NRFX_CHECK(TWI1_ENABLED) && !NRFX_CHECK(TWI1_USE_EASY_DMA))
#define NRF_DRV_TWI_WITH_TWI
#endif
#endif
#if defined(NRF_DRV_TWI_WITH_TWIM) && defined(NRF_DRV_TWI_WITH_TWI)
#define NRF_DRV_TWI_USE_TWIM  (p_instance->use_easy_dma)
#elif defined(NRF_DRV_TWI_WITH_TWIM)
#define NRF_DRV_TWI_USE_TWIM  true
#else
#define NRF_DRV_TWI_USE_TWIM  false
#endif
#define NRF_DRV_TWI_USE_TWI  (!NRF_DRV_TWI_USE_TWIM)

