hananddong/ble_uwb_code/UWB_BLE_nrf52832/integration/nrfx/legacy/nrf_drv_twi.h
__STATIC_INLINE
void nrf_drv_twi_uninit(nrf_drv_twi_t const *p_instance)
{
    if(NRF_DRV_TWI_USE_TWIM)
        nrfx_twim_uninit(&p_instance->u.twim);
        
    else if(NRF_DRV_TWI_USE_TWI)
        nrfx_twi_uninit(&p_instance->u.twi);
}

__STATIC_INLINE
void nrf_drv_twi_enable(nrf_drv_twi_t const *p_instance)
{
    if(NRF_DRV_TWI_USE_TWIM)
        nrfx_twim_enable(&p_instance->u.twim);
        
    else if(NRF_DRV_TWI_USE_TWI)
        nrfx_twi_enable(&p_instance->u.twi);
}

__STATIC_INLINE
void nrf_drv_twi_disable(nrf_drv_twi_t const *p_instance)
{
    if(NRF_DRV_TWI_USE_TWIM)
        nrfx_twim_disable(&p_instance->u.twim);
        
    else if(NRF_DRV_TWI_USE_TWI)
        nrfx_twi_disable(&p_instance->u.twi);
}

__STATIC_INLINE
ret_code_t nrf_drv_twi_tx(nrf_drv_twi_t const *p_instance,
                          uint8_t               address,
                          uint8_t const        *p_data,
                          uint8_t               length,
                          bool                  no_stop)
{
    ret_code_t result = 0;
    
    if(NRF_DRV_TWI_USE_TWIM)
    {
        result = nrfx_twim_tx(&p_instance->u.twim,
                              address, p_data, length, no_stop);
    }
    
    else if(NRF_DRV_TWI_USE_TWI)
    {
        result = nrfx_twi_tx(&p_instance->u.twi,
                             address, p_data, length, no_stop);
    }
    
    return result;
}

__STATIC_INLINE
ret_code_t nrf_drv_twi_rx(nrf_drv_twi_t const *p_instance,
                          uint8_t               address,
                          uint8_t              *p_data,
                          uint8_t               length)
{
    ret_code_t result = 0;
    
    if(NRF_DRV_TWI_USE_TWIM)
    {
        result = nrfx_twim_rx(&p_instance->u.twim,
                              address, p_data, length);
    }
    
    else if(NRF_DRV_TWI_USE_TWI)
    {
        result = nrfx_twi_rx(&p_instance->u.twi,
                             address, p_data, length);
    }
    
    return result;
}

__STATIC_INLINE
ret_code_t nrf_drv_twi_xfer(nrf_drv_twi_t           const *p_instance,
                            nrf_drv_twi_xfer_desc_t const *p_xfer_desc,
                            uint32_t                        flags)
{
    ret_code_t result = 0;
    
    if(NRF_DRV_TWI_USE_TWIM)
    {
        #ifdef TWIM_PRESENT
        nrfx_twim_xfer_desc_t const twim_xfer_desc =
        {
            .type             = (nrfx_twim_xfer_type_t)p_xfer_desc->type,
            .address          = p_xfer_desc->address,
            .primary_length   = p_xfer_desc->primary_length,
            .secondary_length = p_xfer_desc->secondary_length,
            .p_primary_buf    = p_xfer_desc->p_primary_buf,
            .p_secondary_buf  = p_xfer_desc->p_secondary_buf,
        };
        result = nrfx_twim_xfer(&p_instance->u.twim, &twim_xfer_desc, flags);
        #endif
    }
    
    else if(NRF_DRV_TWI_USE_TWI)
    {
        #ifdef TWI_PRESENT
        nrfx_twi_xfer_desc_t const twi_xfer_desc =
        {
            .type             = (nrfx_twi_xfer_type_t)p_xfer_desc->type,
            .address          = p_xfer_desc->address,
            .primary_length   = p_xfer_desc->primary_length,
            .secondary_length = p_xfer_desc->secondary_length,
            .p_primary_buf    = p_xfer_desc->p_primary_buf,
            .p_secondary_buf  = p_xfer_desc->p_secondary_buf,
        };
        result = nrfx_twi_xfer(&p_instance->u.twi, &twi_xfer_desc, flags);
        #endif
    }
    
    return result;
}

__STATIC_INLINE
bool nrf_drv_twi_is_busy(nrf_drv_twi_t const *p_instance)
{
    bool result = 0;
    
    if(NRF_DRV_TWI_USE_TWIM)
        result = nrfx_twim_is_busy(&p_instance->u.twim);
        
    else if(NRF_DRV_TWI_USE_TWI)
        result = nrfx_twi_is_busy(&p_instance->u.twi);
        
    return result;
}

__STATIC_INLINE
uint32_t nrf_drv_twi_data_count_get(nrf_drv_twi_t const *const p_instance)
{
    uint32_t result = 0;
    
    if(NRF_DRV_TWI_USE_TWIM)
    {
        NRFX_ASSERT(false); // not supported
        result = 0;
    }
    
    else if(NRF_DRV_TWI_USE_TWI)
        result = nrfx_twi_data_count_get(&p_instance->u.twi);
        
    return result;
}

__STATIC_INLINE
uint32_t nrf_drv_twi_start_task_get(nrf_drv_twi_t const *p_instance,
                                    nrf_drv_twi_xfer_type_t xfer_type)
{
    uint32_t result = 0;
    
    if(NRF_DRV_TWI_USE_TWIM)
    {
        result = nrfx_twim_start_task_get(&p_instance->u.twim,
                                          (nrfx_twim_xfer_type_t)xfer_type);
    }
    
    else if(NRF_DRV_TWI_USE_TWI)
    {
        NRFX_ASSERT(false); // not supported
        result = 0;
    }
    
    return result;
}

__STATIC_INLINE
uint32_t nrf_drv_twi_stopped_event_get(nrf_drv_twi_t const *p_instance)
{
    uint32_t result = 0;
    
    if(NRF_DRV_TWI_USE_TWIM)
        result = nrfx_twim_stopped_event_get(&p_instance->u.twim);
        
    else if(NRF_DRV_TWI_USE_TWI)
        result = nrfx_twi_stopped_event_get(&p_instance->u.twi);
        
    return result;
}

#endif // SUPPRESS_INLINE_IMPLEMENTATION

/** @} */

#ifdef __cplusplus
}
#endif

#endif // NRF_DRV_TWI_H__
